### Introduction Pandas

In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.23.3'

In [3]:
pokemon_games = pd.DataFrame(
{
    "name": ["blue","red","yellow","gold","silver"],
    "date": ["1996","1996","1998","1999","1999"],
    "pokedex" : [151,151,151,251,251],
    
}
)
pokemon_games

     name  date  pokedex
0    blue  1996      151
1     red  1996      151
2  yellow  1998      151
3    gold  1999      251
4  silver  1999      251

In [6]:
pokemon_games = pd.DataFrame(
   [["Blue",1996,151],
    ["Red",1996,151],
    ["Yellow",1998,151],
    ["Gold",1999,251],
    ["Silver",1999,251] ], columns = ["Name", "Date","Pokedex"]
)
pokemon_games

     Name  Date  Pokedex
0    Blue  1996      151
1     Red  1996      151
2  Yellow  1998      151
3    Gold  1999      251
4  Silver  1999      251

### Exercises with Pandas

In [10]:
#import pandas
import pandas as pd

In [11]:
#Create a list of numbers
numbers = [10,20,10]

In [12]:
#Create a list of objects
objects = ["rojo","verde","azul"]

In [13]:
#create a dataframe
df = pd.DataFrame()

In [14]:
#create a new column and assign numbers
df["numbers"] = numbers

In [15]:
#create a new column and assign objects
df["objects"] = objects

In [16]:
df

   numbers objects
0       10    rojo
1       20   verde
2       10    azul

In [27]:
#read a csv
avengers = pd.read_csv("data/avengers.csv")

In [ ]:
#show the first five files
avengers.head()

In [ ]:
#show the first ten files
avengers.head(10)

In [ ]:
#show the last five files
avengers.tail()

In [ ]:
#show the size of the dataframe
avengers.shape

In [ ]:
#Reset the index
avengers = avengers.reset_index()

In [28]:
df.head(2)

   numbers objects
0       10    rojo
1       20   verde

In [29]:
df.shape

(3, 2)

In [30]:
df.reset_index()

   index  numbers objects
0      0       10    rojo
1      1       20   verde
2      2       10    azul